{
    "holidays": [
      {
        "id": 1,
        "holiday": "New Year's Day",
        "date": "Saturday, January 1, 2022",
        "details": "New Year's Day is the first day of the Gregorian calendar, which is widely used in many countries such as the USA."
      },
      {
        "id": 2,
        "holiday": "World Braille Day",
        "date": "Tuesday, January 4, 2022",
        "details": "World Braille Day celebrates the life and achievements of Louis Braille, who invented the braille code for the visually impaired."
      },
      {
        "id": 3,
        "holiday": "Epiphany",
        "date": "Thursday, January 6, 2022",
        "details": "Many people in the United States annually observe Epiphany, or Three Kings’ Day, on January 6. It is a Christian observance and a public holiday in the US Virgin Islands."

      },
      {
        "id": 4,
        "holiday": "Orthodox Christmas Day",
        "date": "Friday, January 7, 2022",
        "details": "Many Orthodox Christian churches in countries such as the United States observe Christmas Day on or near January 7 in the Gregorian calendar."

      },
      {
        "id": 5,
        "holiday": "International Programmers' Day",
        "date": "Friday, January 7, 2022",
        "details": "Many people celebrate International Programmers’ Day on January 7, while others observe this event on the 256th day of the year, usually on September 13 or on September 12 in leap years."

      },
      {
        "id": 6,
        "holiday": "Stephen Foster Memorial Day",
        "date": "Thursday, January 13, 2022",
        "details": "Stephen Foster Memorial Day is annually observed in the United States on January 13. The day remembers the achievements of Stephen Foster, who is known as the “father of American music”."
      },
      {
        "id": 7,
        "holiday": "Orthodox New Year",
        "date": "Friday, January 14, 2022",
        "details": "Many Orthodox Christian churches in countries such as the United States celebrate New Year’s Day on January 14 in the Gregorian calendar."
      },
      {
        "id": 8,
        "holiday": "World Religion Day",
        "date": "Sunday, January 16, 2022",
        "details": "World Religion Day fosters interfaith dialogue and understanding of all religions."
      },
      {
        "id": 9,
        "holiday": "Tu Bishvat/Tu B'Shevat",
        "date": "Monday, January 17, 2022",
        "details": "Tu B’Shevat is known as the “New Year for Trees”, is a Jewish festival similar to Arbor Day."
      },
      {
        "id": 10,
        "holiday": "Martin Luther King Jr. Day",
        "date": "Monday, January 17, 2022",
        "details": "Martin Luther King Day marks the anniversary of the date of birth of the influential American civil right leader of the same name."
      },
      {
        "id": 11,
        "holiday": "Robert E. Lee's Birthday",
        "date": "Monday, January 17, 2022",
        "details": "Robert E. Lee’s birthday is an annual official state holiday that is shared with Martin Luther King’s birthday in some parts of the US."
      },
      {
        "id": 12,
        "holiday": "Idaho Human Rights Day",
        "date": "Monday, January 17, 2022",
        "details": "Idaho Human Rights Day is a state holiday in Idaho, the United States, on the third Monday of January."
      },
      {
        "id": 13,
        "holiday": "Civil Rights Day",
        "date": "Monday, January 17, 2022",
        "details": "Civil Rights Day is on the third Monday of January in Arizona and New Hampshire. It honors civil rights activists such as Martin Luther King Jr."
      },
      {
        "id": 14,
        "holiday": "Robert E. Lee's Birthday",
        "date": "Wednesday, January 19, 2022",
        "details": "Robert E. Lee’s birthday is an annual official state holiday that is shared with Martin Luther King’s birthday in some parts of the US."
      },
      {
        "id": 15,
        "holiday": "Confederate Heroes' Day",
        "date": "Wednesday, January 19, 2022",
        "details": "On Confederate Memorial Day remembers the soldiers who died fighting for the Confederate States of America during the American Civil War (1861-1865). It is a state holiday in some parts of the United States."
      },
      {
        "id": 16,
        "holiday": "International Customs Day",
        "date": "Wednesday, January 26, 2022",
        "details": "International Customs Day celebrates custom personnel and agencies worldwide."
      },
      {
        "id": 17,
        "holiday": "International Day of Commemoration in Memory of the Victims of the Holocaust",
        "date": "Thursday, January 27, 2022",
        "details": "The United Nations' (UN) International Day of Commemoration in Memory of the Victims of the Holocaust remembers those who died and suffered during the Holocaust before and during World War II. It is on January 27 each year."
      },
      {
        "id": 18,
        "holiday": "Kansas Day",
        "date": "Saturday, January 29, 2022",
        "details": "Kansas Day is an annual observance that commemorates the state's admission to the Union in 1861."
      },
      {
        "id": 19,
        "holiday": "World Leprosy Day",
        "date": "Sunday, January 30, 2022",
        "details": "World Leprosy Day brings awareness of leprosy, also known as Hansen's disease, and ways to prevent the disease."
      },
      {
        "id": 20,
        "holiday": "National Freedom Day",
        "date": "Tuesday, February 1, 2022",
        "details": "National Freedom Day in the United States is observed on February 1 each year."
      },
      {
        "id": 21,
        "holiday": "Chinese New Year",
        "date": "Tuesday, February 1, 2022",
        "details": "Chinese New Year marks the first day of the New Year in the Chinese calendar."
      },
      {
        "id": 22,
        "holiday": "First Day of Black History Month",
        "date": "Tuesday, February 1, 2022",
        "details": "First Day of Black History Month is a annual monthly observance in the USA"
      },
      {
        "id": 23,
        "holiday": "World Wetlands Day",
        "date": "Wednesday, February 2, 2022",
        "details": "World Wetlands Day raises awareness about the important role that the wetlands play in the environment and in our lives."
      },
      {
        "id": 24,
        "holiday": "Groundhog Day",
        "date": "Wednesday, February 2, 2022",
        "details": "Many people in the United States observe Groundhog Day on February 2."
      },
      {
        "id": 25,
        "holiday": "World Cancer Day",
        "date": "Friday, February 4, 2022",
        "details": "World Cancer Day is an annual global event on February 4 to raise people’s awareness of cancer."
      },
      {
        "id": 26,
        "holiday": "Rosa Parks Day",
        "date": "Friday, February 4, 2022",
        "details": "The life of American civil rights leader Rosa Parks is celebrated in the United States on either February 4 or December 1."
      },
      {
        "id": 27,
        "holiday": "National Wear Red Day",
        "date": "Friday, February 4, 2022",
        "details": "National Wear Red Day® raises public awareness of heart disease in women and ways to avoid and combat this problem."
      },
      {
        "id": 28,
        "holiday": "International Day of Zero Tolerance for Female Genital Mutilation",
        "date": "Sunday, February 6, 2022",
        "details": "The International Day of Zero Tolerance for Female Genital Mutilation is an awareness campaign to end a harmful practice that violates girls’ and women’s rights."
      },
      {
        "id": 29,
        "holiday": "International Day of Women and Girls in Science",
        "date": "Friday, February 11, 2022",
        "details": "The International Day of Women and Girls in Science is a UN holiday to recognize the critical role women and girls play in science and technology communities."
      },
      {
        "id": 30,
        "holiday": "World Day of the Sick",
        "date": "Friday, February 11, 2022",
        "details": "World Day of the Sick is a global event when people remember or pray for the sick."
      },
      {
        "id": 31,
        "holiday": "Lincoln's Birthday observed",
        "date": "Friday, February 11, 2022",
        "details": "Lincoln’s Birthday is observed in the United States in honor of Abraham Lincoln, who was the nation’s 16th president and was known as the Great Emancipator."
      },
      {
        "id": 32,
        "holiday": "Lincoln's Birthday",
        "date": "Saturday, February 12, 2022",
        "details": "Lincoln’s Birthday is observed in the United States in honor of Abraham Lincoln, who was the nation’s 16th president and was known as the Great Emancipator."
      },
      {
        "id": 33,
        "holiday": "World Radio Day",
        "date": "Sunday, February 13, 2022",
        "details": "World Radio Day is an annual United Nations (UN) event that promotes the importance of the radio in communicating information worldwide."
      },
      {
        "id": 34,
        "holiday": "Super Bowl",
        "date": "Sunday, February 13, 2022",
        "details": "The Super Bowl is the championship game of the National Football League (NFL) in the United States. It is played every year in February."
      },
      {
        "id": 35,
        "holiday": "Valentine's Day",
        "date": "Monday, February 14, 2022",
        "details": "Valentine's Day is an occasion to celebrate romantic love."
      },
      {
        "id": 36,
        "holiday": "Statehood Day",
        "date": "Monday, February 14, 2022",
        "details": "Statehood Day is a local observance in the USA"
      },
      {
        "id": 37,
        "holiday": "Susan B. Anthony's Birthday",
        "date": "Tuesday, February 15, 2022",
        "details": "Susan B Anthony Day is an national American observance that is legally recognized in some states."
      },
      {
        "id": 38,
        "holiday": "Elizabeth Peratrovich Day",
        "date": "Wednesday, February 16, 2022",
        "details": "Elizabeth Peratrovich was one of the main driving forces behind the territory's Anti-Discrimination Act of 1945."
      },
      {
        "id": 39,
        "holiday": "World Day of Social Justice",
        "date": "Sunday, February 20, 2022",
        "details": "The United Nations' (UN) World Day of Social Justice promotes poverty eradication, full employment and social integration. It is on February 20 each year."
      },
      {
        "id": 40,
        "holiday": "International Mother Language Day",
        "date": "Monday, February 21, 2022",
        "details": "The United Nations' (UN) International Mother Language Day is annually held on February 21 to celebrate languages spoken worldwide. It also observes the human right to use these languages."
      },
      {
        "id": 41,
        "holiday": "Presidents' Day",
        "date": "Monday, February 21, 2022",
        "details": "Washington's Birthday, or Presidents' Day, honors the life and work of the first president of the United States, George Washington."
      },
      {
        "id": 42,
        "holiday": "Daisy Gatson Bates Day",
        "date": "Monday, February 21, 2022",
        "details": "Daisy Gatson Bates Day is a state holiday in Arkansas, the United States, on the third Monday of February. It coincides with Washington’s Birthday."
      },
      {
        "id": 43,
        "holiday": "George Rogers Clark Day",
        "date": "Friday, February 25, 2022",
        "details": "George Rogers Clark Day is a local observance in the USA"
      },
      {
        "id": 44,
        "holiday": "Linus Pauling Day",
        "date": "Monday, February 28, 2022",
        "details": "Linus Pauling Day is a state holiday on February 28 in Oregon, USA."
      },
      {
        "id": 45,
        "holiday": "Isra and Mi'raj",
        "date": "Tuesday, March 1, 2022",
        "details": "Isra and Mi'raj (Isra Me'raj, Israa and Mi'raaj, Laylat Al-Isra wa Al-Miraj, Lailat al Miraj, Night Journey and Ascension to Heaven) marks the night when the Prophet Mohammad traveled from Mecca to Jerusalem, ascended to heaven and returned."
      },
      {
        "id": 46,
        "holiday": "Zero Discrimination Day",
        "date": "Tuesday, March 1, 2022",
        "details": "Discrimination Day highlights the negative impacts of discrimination and promotes tolerance, compassion and peace."
      },
      {
        "id": 47,
        "holiday": "Self-Injury Awareness Day",
        "date": "Tuesday, March 1, 2022",
        "details": ""
      },
      {
        "id": 48,
        "holiday": "Shrove Tuesday/Mardi Gras",
        "date": "Tuesday, March 1, 2022",
        "details": "Shrove Tuesday is traditionally known as the day prior to Lent but it also serves as a day of celebration, known as Mardi Gras."
      },
      {
        "id": 49,
        "holiday": "St. David's Day",
        "date": "Tuesday, March 1, 2022",
        "details": "Many Welsh communities in the United States celebrate the life of their patron saint, St David, and their links with Wales on St David’s Day."
      },
      {
        "id": 50,
        "holiday": "Town Meeting Day",
        "date": "Tuesday, March 1, 2022",
        "details": "The state of Vermont, in the USA, holds its Town Meeting Day on the first Tuesday of March each year."
      },
      {
        "id": 51,
        "holiday": "First Day of Women's History Month",
        "date": "Tuesday, March 1, 2022",
        "details": "First Day of Women's History Month is a annual monthly observance in the USA"
      },
      {
        "id": 52,
        "holiday": "Ash Wednesday",
        "date": "Wednesday, March 2, 2022",
        "details": "Ash Wednesday is a Christian observance that marks the first day of Lent, which is prior to Easter."
      },
      {
        "id": 53,
        "holiday": "Texas Independence Day",
        "date": "Wednesday, March 2, 2022",
        "details": "Texas Independence Day is a legal holiday in Texas, in the United States."
      },
      {
        "id": 54,
        "holiday": "Read Across America Day",
        "date": "Wednesday, March 2, 2022",
        "details": "Read Across America Day is observed in the United States on March 2 each year."
      },
      {
        "id": 55,
        "holiday": "World Wildlife Day",
        "date": "Thursday, March 3, 2022",
        "details": "World Wildlife Day celebrates all flora and fauna, including animals, on Earth."
      },
      {
        "id": 56,
        "holiday": "Employee Appreciation Day",
        "date": "Friday, March 4, 2022",
        "details": "Employee Appreciation Day is a US unofficial observance that recognizes and appreciates employees in all industries, aimed at helping employers keep their staff."
      },
      {
        "id": 57,
        "holiday": "Casimir Pulaski Day",
        "date": "Monday, March 7, 2022",
        "details": "Casimir Pulaski Day is a day off for some schools and offices in Illinois, USA, on the first Monday of March each year."
      },
      {
        "id": 58,
        "holiday": "International Women's Day",
        "date": "Tuesday, March 8, 2022",
        "details": "International Women’s Day celebrates women’s achievements worldwide and throughout history."
      },
      {
        "id": 59,
        "holiday": "World Kidney Day",
        "date": "Thursday, March 10, 2022",
        "details": "World Kidney Day is an annual observation that attempts to raise global awareness about the importance of kidney health and tries to bring attention to the unique challenges faced by those who suffer from Chronic Kidney Disease."
      },
      {
        "id": 60,
        "holiday": "Daylight Saving Time starts",
        "date": "Sunday, March 13, 2022",
        "details": "Daylight Saving Time starts in the USA"
      },
      {
        "id": 61,
        "holiday": "Purim",
        "date": "Thursday, March 17, 2022",
        "details": "Purim commemorates a time when Jewish people were saved from death around the fourth century BCE, according to the Book of Esther."
      },
      {
        "id": 62,
        "holiday": "St. Patrick's Day",
        "date": "Thursday, March 17, 2022",
        "details": "St Patrick's Day marks the life and deeds of St Patrick, one of Ireland's patron saints. It is an Irish-American celebration in the USA."
      },
      {
        "id": 63,
        "holiday": "Evacuation Day",
        "date": "Thursday, March 17, 2022",
        "details": "Evacuation Day in Suffolk County, Massachusetts, commemorates the first major American military victory in the Revolutionary War, which saw the British troops evacuate Boston."
      },
      {
        "id": 64,
        "holiday": "International Day of Happiness",
        "date": "Sunday, March 20, 2022",
        "details": "International Day of Happiness aims to promote the idea that the pursuit of happiness is universal."
      },
      {
        "id": 65,
        "holiday": "March Equinox",
        "date": "Sunday, March 20, 2022",
        "details": "March Equinox in the USA (New York)"
      },
      {
        "id": 66,
        "holiday": "International Day for the Elimination of Racial Discrimination",
        "date": "Monday, March 21, 2022",
        "details": "The United Nations’ (UN) International Day for the Elimination of Racial Discrimination is annually observed on March 21."
      },
      {
        "id": 67,
        "holiday": "World Poetry Day",
        "date": "Monday, March 21, 2022",
        "details": "World Poetry Day celebrates poetry around the world on March 21 each year."
      },
      {
        "id": 68,
        "holiday": "International Day of Nowruz",
        "date": "Monday, March 21, 2022",
        "details": "The UN’s International Day of Nowruz, also known as Nowruz, No-Ruz, No-Rooz or No Ruz, is observed on March 21 each year."
      },
      {
        "id": 69,
        "holiday": "World Down Syndrome Day",
        "date": "Monday, March 21, 2022",
        "details": "World Down Syndrome Day is held on March 21 every year."
      },
      {
        "id": 70,
        "holiday": "International Day of Forests",
        "date": "Monday, March 21, 2022",
        "details": "International Day of Forests raises awareness on forests and trees, including their role in climate change."
      },
      {
        "id": 71,
        "holiday": "World Water Day",
        "date": "Tuesday, March 22, 2022",
        "details": "World Water Day aims to increase people's awareness of the water's importance in all aspects of life."
      },
      {
        "id": 72,
        "holiday": "World Meteorological Day",
        "date": "Wednesday, March 23, 2022",
        "details": "World Meteorological Day marks the anniversary of the World Meteorological Organization's establishment on March 23, 1950."
      },
      {
        "id": 73,
        "holiday": "World Tuberculosis Day",
        "date": "Thursday, March 24, 2022",
        "details": "World Tuberculosis Day is annually held on March 24 to raise awareness of tuberculosis and ways to eradicate the disease."
      },
      {
        "id": 74,
        "holiday": "International Day for the Right to the Truth concerning Gross Human Rights Violations and for the Dignity of Victims",
        "date": "Thursday, March 24, 2022",
        "details": "March 24 is the UN’s International Day for the Right to the Truth concerning Gross Human Rights Violations and for the Dignity of Victims"
      },
      {
        "id": 75,
        "holiday": "International Day of Remembrance of Slavery Victims and the Transatlantic Slave Trade",
        "date": "Friday, March 25, 2022",
        "details": "The International Day of Remembrance of the Victims of Slavery and the Transatlantic Slave Trade remembers the lives of Africans who were forced into slavery in North, Central and South America."
      },
      {
        "id": 76,
        "holiday": "International Day of Solidarity with Detained and Missing Staff Members",
        "date": "Friday, March 25, 2022",
        "details": "The UN’s International Day of Solidarity with Detained and Missing Staff Members is annually held on March 25."
      },
      {
        "id": 77,
        "holiday": "Maryland Day",
        "date": "Friday, March 25, 2022",
        "details": "Maryland Day commemorates the arrival of Lord Baltimore and the first colonists in Maryland, the United States, in the 17th century."
      },
      {
        "id": 78,
        "holiday": "Prince Jonah Kuhio Kalanianaole Day observed",
        "date": "Friday, March 25, 2022",
        "details": "Prince Jonah Kuhio Kalanianaole Day is annually held in Hawaii on March 26 to honor Prince Jonah Kuhio Kalanianaole."
      },
      {
        "id": 79,
        "holiday": "Earth Hour",
        "date": "Saturday, March 26, 2022",
        "details": "Earth Hour is an annual event in which many people worldwide turn their lights off on the last Saturday in March."
      },
      {
        "id": 80,
        "holiday": "Prince Jonah Kuhio Kalanianaole Day",
        "date": "Saturday, March 26, 2022",
        "details": "Prince Jonah Kuhio Kalanianaole Day is annually held in Hawaii on March 26 to honor Prince Jonah Kuhio Kalanianaole."
      },
      {
        "id": 81,
        "holiday": "Seward's Day",
        "date": "Monday, March 28, 2022",
        "details": "Seward’s Day is a state holiday in Alaska, in the United States, on the last Monday of March."
      },
      {
        "id": 82,
        "holiday": "National Vietnam War Veterans Day",
        "date": "Tuesday, March 29, 2022",
        "details": "National Vietnam War Veterans Day is an US observance to honor US military members who served during the Vietnam War."
      },
      {
        "id": 83,
        "holiday": "Doctors' Day",
        "date": "Wednesday, March 30, 2022",
        "details": "Doctors' Day is a observance in the USA"
      },
      {
        "id": 84,
        "holiday": "César Chávez Day",
        "date": "Thursday, March 31, 2022",
        "details": "César Chávez Day celebrates the birthday of César Estrada Chávez."
      },
      {
        "id": 85,
        "holiday": "April Fool's Day",
        "date": "Friday, April 1, 2022",
        "details": "April Fool's Day, on April 1, is a day to play practical jokes and tricks."
      },
      {
        "id": 86,
        "holiday": "Pascua Florida Day observed",
        "date": "Friday, April 1, 2022",
        "details": "Pascua Florida Day, which usually falls on April 2, is a state day in Florida, USA."
      },
      {
        "id": 87,
        "holiday": "World Autism Awareness Day",
        "date": "Saturday, April 2, 2022",
        "details": "World Autism Awareness Day raises an awareness of issues surrounding people, particularly children, with autism worldwide."
      },
      {
        "id": 88,
        "holiday": "Pascua Florida Day",
        "date": "Saturday, April 2, 2022",
        "details": "Pascua Florida Day, which usually falls on April 2, is a state day in Florida, USA."
      },
      {
        "id": 89,
        "holiday": "Ramadan Starts",
        "date": "Sunday, April 3, 2022",
        "details": "Many Muslims in the United States fast in the hours of daylight during Ramadan, the ninth month in the Islamic calendar."
      },
      {
        "id": 90,
        "holiday": "United Nations' Mine Awareness Day",
        "date": "Monday, April 4, 2022",
        "details": "The United Nations' International Day for Mine Awareness and Assistance in Mine Action is annually observed on April 4."
      },
      {
        "id": 91,
        "holiday": "International Day of Sport for Development and Peace",
        "date": "Wednesday, April 6, 2022",
        "details": "The International Day of Sport for Development and Peace aims to bring goodwill and positive social outcomes through sporting achievements."
      },
      {
        "id": 92,
        "holiday": "National Tartan Day",
        "date": "Wednesday, April 6, 2022",
        "details": "National Tartan Day is annually observed on April 6 to honor the major role that Scottish Americans played in the founding of the United States of America."
      },
      {
        "id": 93,
        "holiday": "United Nations' World Health Day",
        "date": "Thursday, April 7, 2022",
        "details": "The World Health Organization, the United Nations' the directing and coordinating authority for health, annually highlights one of its priorities for global health on World Health Day."
      },
      {
        "id": 94,
        "holiday": "Day of Remembrance of the Victims of the Rwanda Genocide",
        "date": "Thursday, April 7, 2022",
        "details": "The UN’s Day of Remembrance of the Victims of the Rwanda Genocide is observed on April 7 each year."
      },
      {
        "id": 95,
        "holiday": "Palm Sunday",
        "date": "Sunday, April 10, 2022",
        "details": "Palm Sunday in the United States celebrates Jesus Christ’s entry into Jerusalem. It is also the Sunday before Easter Sunday."
      },
      {
        "id": 96,
        "holiday": "International Day of Human Space Flight",
        "date": "Tuesday, April 12, 2022",
        "details": "The UN’s International Day of Human Space Flight is annually held on April 12."
      },
      {
        "id": 97,
        "holiday": "National Library Workers' Day",
        "date": "Tuesday, April 12, 2022",
        "details": "National Library Workers’ Day recognizes the efforts and achievements that librarians make to give Americans access to information via books, computers and other media."
      },
      {
        "id": 98,
        "holiday": "Thomas Jefferson's Birthday",
        "date": "Wednesday, April 13, 2022",
        "details": "Americans celebrate president Thomas Jefferson's Birthday on April 13."
      },
      {
        "id": 99,
        "holiday": "Maundy Thursday",
        "date": "Thursday, April 14, 2022",
        "details": "Maundy Thursday, which is also known as Holy Thursday, is the day before Good Friday."
      },
      {
        "id": 100,
        "holiday": "Passover Eve",
        "date": "Friday, April 15, 2022",
        "details": "Passover Eve is a Jewish holiday in the USA"
      },
      {
        "id": 101,
        "holiday": "Good Friday",
        "date": "Friday, April 15, 2022",
        "details": "Good Friday commemorates Jesus Christ's crucifixion."
      },
      {
        "id": 101,
        "holiday": "Father Damien Day",
        "date": "Friday, April 15, 2022",
        "details": "Father Damien Day or Saint Damien Day is an occasion for residents of the state of Hawaii to remember the life and deeds of a Belgian missionary."
      },
      {
        "id": 102,
        "holiday": "Emancipation Day observed",
        "date": "Friday, April 15, 2022",
        "details": "People celebrate the end of slavery and citizens' rights on Emancipation Day in the United States."
      },
      {
        "id": 103,
        "holiday": "Holy Saturday",
        "date": "Saturday, April 16, 2022",
        "details": "Holy Saturday is the day before Easter Sunday in the United States."
      },
      {
        "id": 104,
        "holiday": "Passover (first day)",
        "date": "Saturday, April 16, 2022",
        "details": "Passover marks the Israelites' liberation from slavery and their exodus from Egypt around 3000 years ago."
      },
      {
        "id": 105,
        "holiday": "Emancipation Day",
        "date": "Saturday, April 16, 2022",
        "details": "People celebrate the end of slavery and citizens' rights on Emancipation Day in the United States."
      },
      {
        "id": 106,
        "holiday": "Easter Sunday",
        "date": "Sunday, April 17, 2022",
        "details": "Easter Sunday is an important day in the Christian church calendar because it celebrates Jesus Christ's resurrection, according to Christian belief."
      },
      {
        "id": 107,
        "holiday": "International Day for Monuments and Sites",
        "date": "Monday, April 18, 2022",
        "details": "The International Day for Monuments and Sites raises awareness on preserving and conserving historical and archeological heritage sites."
      },
      {
        "id": 108,
        "holiday": "Easter Monday",
        "date": "Monday, April 18, 2022",
        "details": "Easter Monday is the day after Easter Sunday. It is not a federal holiday in the United States of America (USA)."
      },
      {
        "id": 109,
        "holiday": "Tax Day",
        "date": "Monday, April 18, 2022",
        "details": "Tax Day is the deadline for United States residents to file details of their income to the Internal Revenue Service (IRS) so that their liability for income tax can be assessed."
      },
      {
        "id": 110,
        "holiday": "Patriot's Day",
        "date": "Monday, April 18, 2022",
        "details": "Patriot's Day commemorates the battles of Lexington and Concord in 1775, which were two of the earliest battles in the American Revolutionary War."
      },
      {
        "id": 111,
        "holiday": "Boston Marathon",
        "date": "Monday, April 18, 2022",
        "details": "Boston Marathon is one of the world's oldest yearly marathon. It is held annually on Patriot's Day in the month of April."
      },
      {
        "id": 112,
        "holiday": "Chinese Language Day",
        "date": "Wednesday, April 20, 2022",
        "details": "Chinese Language Day is a United Nations observance that celebrates one of the organization’s 6 official languages – Chinese."
      },
      {
        "id": 113,
        "holiday": "San Jacinto Day",
        "date": "Thursday, April 21, 2022",
        "details": "San Jacinto Day commemorates the Battle of San Jacinto in what is now Harris County, Texas."
      },
      {
        "id": 114,
        "holiday": "Orthodox Good Friday",
        "date": "Friday, April 22, 2022",
        "details": "Many Orthodox Christians in the United States remember the events leading up to Jesus Christ's crucifixion on Great Friday."
      },
      {
        "id": 115,
        "holiday": "Earth Day",
        "date": "Friday, April 22, 2022",
        "details": "The United Nations' International Mother Earth Day promotes environmental awareness and calls for the protection of our planet."
      },
      {
        "id": 116,
        "holiday": "Oklahoma Day",
        "date": "Friday, April 22, 2022",
        "details": "Oklahoma Day in the United States marks the anniversary of the opening of Oklahoma's lands to European settlers."
      },
      {
        "id": 117,
        "holiday": "Last Day of Passover",
        "date": "Saturday, April 23, 2022",
        "details": "The last day of Passover marks the end of the Passover period, which lasts for seven or eight days."
      },
      {
        "id": 118,
        "holiday": "Orthodox Holy Saturday",
        "date": "Saturday, April 23, 2022",
        "details": "Many Orthodox Christians in the United States remember Jesus Christ’s burial and his descent into Hades on Holy Saturday."
      },
      {
        "id": 119,
        "holiday": "World Book and Copyright Day",
        "date": "Saturday, April 23, 2022",
        "details": "World Book and Copyright Day is an occasion to celebrate the contribution of books and authors to our global culture and the connection between copyright and books."
      },
      {
        "id": 120,
        "holiday": "English Language Day",
        "date": "Saturday, April 23, 2022",
        "details": "English Language Day promotes the history, culture and accomplishments of the English language."
      },
      {
        "id": 121,
        "holiday": "Orthodox Easter",
        "date": "Sunday, April 24, 2022",
        "details": "Many Orthodox Christians in the United States mark Easter Sunday, also known as Pascha, as the day Jesus Christ was resurrected, according to the Christian bible."
      },
      {
        "id": 122,
        "holiday": "Orthodox Easter Monday",
        "date": "Monday, April 25, 2022",
        "details": "Many Orthodox churches in the United States observe Easter Monday on the day after the Orthodox Easter Sunday date."
      },
      {
        "id": 123,
        "holiday": "World Malaria Day",
        "date": "Monday, April 25, 2022",
        "details": "World Malaria Day is annually observed on April 25 to promote efforts that provide effective control of malaria worldwide."
      },
      {
        "id": 124,
        "holiday": "Confederate Memorial Day",
        "date": "Monday, April 25, 2022",
        "details": "On Confederate Memorial Day remembers the soldiers who died fighting for the Confederate States of America during the American Civil War (1861-1865). It is a state holiday in some parts of the United States."
      },
      {
        "id": 125,
        "holiday": "State Holiday",
        "date": "Monday, April 25, 2022",
        "details": "On Confederate Memorial Day remembers the soldiers who died fighting for the Confederate States of America during the American Civil War (1861-1865). It is a state holiday in some parts of the United States."
      },
      {
        "id": 126,
        "holiday": "World Intellectual Property Day",
        "date": "Tuesday, April 26, 2022",
        "details": "World Intellectual Property Day is annually held on April 26 to increase awareness and understanding of intellectual property worldwide."
      },
      {
        "id": 127,
        "holiday": "International Chernobyl Disaster Remembrance Day",
        "date": "Tuesday, April 26, 2022",
        "details": "International Chernobyl Disaster Remembrance Day is a UN holiday designed to raise awareness of the consequences of the 1986 nuclear accident."
      },
      {
        "id": 128,
        "holiday": "Confederate Heroes' Day",
        "date": "Tuesday, April 26, 2022",
        "details": "On Confederate Memorial Day remembers the soldiers who died fighting for the Confederate States of America during the American Civil War (1861-1865). It is a state holiday in some parts of the United States."
      },
      {
        "id": 129,
        "holiday": "Yom HaShoah",
        "date": "Wednesday, April 27, 2022",
        "details": "Many people in the United States observe Yom Hashoah by remembering Holocaust victims who died during World War II."
      },
      {
        "id": 130,
        "holiday": "Administrative Professionals Day",
        "date": "Wednesday, April 27, 2022",
        "details": "Administrative Professionals Day® is on the Wednesday of the last full week of April. It remembers the important role of administrative professionals."
      },
      {
        "id": 131,
        "holiday": "Lailat al-Qadr",
        "date": "Thursday, April 28, 2022",
        "details": "Laylat al Qadr is most likely to be held on one of the last 10 days of month of Ramadan in the Islamic calendar."
      },
      {
        "id": 132,
        "holiday": "World Day for Safety and Health at Work",
        "date": "Thursday, April 28, 2022",
        "details": "The World Day for Safety and Health at Work is observed on April 28 each year."
      },
      {
        "id": 133,
        "holiday": "Take our Daughters and Sons to Work Day",
        "date": "Thursday, April 28, 2022",
        "details": "Take our Daughters and Sons to Work Day is a observance in the USA"
      },
      {
        "id": 134,
        "holiday": "Arbor Day",
        "date": "Friday, April 29, 2022",
        "details": "Arbor Day encourages people to plant and care for trees. In Nebraska, it falls on the last Friday of April."
      },
      {
        "id": 135,
        "holiday": "International Jazz Day",
        "date": "Saturday, April 30, 2022",
        "details": "International Jazz Day recognizes the historical, cultural, and educational contribution of jazz."
      },
      {
        "id": 136,
        "holiday": "Law Day",
        "date": "Sunday, May 1, 2022",
        "details": "Law Day in the United States is annually held on May 1."
      },
      {
        "id": 137,
        "holiday": "Loyalty Day",
        "date": "Sunday, May 1, 2022",
        "details": "Loyalty Day is a special day for people to reaffirm their loyalty to the United States and to recognize the heritage of American freedom."
      },
      {
        "id": 138,
        "holiday": "Lei Day",
        "date": "Sunday, May 1, 2022",
        "details": "May Day is Lei Day in Hawai'i, celebrating Hawaiian culture or the “Aloha spirit."
      },
      {
        "id": 139,
        "holiday": "First Day of Asian Pacific American Heritage Month",
        "date": "Sunday, May 1, 2022",
        "details": "First Day of Asian Pacific American Heritage Month is a annual monthly observance in the USA"
      },
      {
        "id": 140,
        "holiday": "World Tuna Day",
        "date": "Monday, May 2, 2022",
        "details": "World Tuna Day is a UN holiday designed to raise awareness of the global importance of tuna."
      },
      {
        "id": 141,
        "holiday": "Eid al-Fitr",
        "date": "Tuesday, May 3, 2022",
        "details": "Eid al-Fitr, which is on the first day of the Islamic month of Shawwal, marks the end of the month-long fast of Ramadan."
      },
      {
        "id": 142,
        "holiday": "World Press Freedom Day",
        "date": "Tuesday, May 3, 2022",
        "details": "World Press Freedom Day focuses on the importance of the freedom of the press and freedom of expression."
      },
      {
        "id": 143,
        "holiday": "Kent State Shootings Remembrance",
        "date": "Wednesday, May 4, 2022",
        "details": "Kent State Shootings Remembrance Day is a local observance in Kent, Ohio."
      },
      {
        "id": 144,
        "holiday": "Rhode Island Independence Day",
        "date": "Wednesday, May 4, 2022",
        "details": "Rhode Island Independence Day is a day to celebrate the state's declaration of independence from Great Britain in 1776."
      },
      {
        "id": 145,
        "holiday": "Yom Ha'atzmaut",
        "date": "Thursday, May 5, 2022",
        "details": "Many Jewish communities in the United States celebrate Yom Ha’Atzmaut, which is Israel’s Independence Day, on the fifth day of the month of Iyar in the Jewish calendar."
      },
      {
        "id": 146,
        "holiday": "Cinco de Mayo",
        "date": "Thursday, May 5, 2022",
        "details": "'Cinco de Mayo' means 'Fifth of May' in Spanish and is a festival of Mexican pride and heritage."
      },
      {
        "id": 147,
        "holiday": "National Day of Prayer",
        "date": "Thursday, May 5, 2022",
        "details": "National Day of Prayer is held on the first Thursday of May each year, inviting Americans of all faiths to pray for the country and its leaders."
      },
      {
        "id": 148,
        "holiday": "Kentucky Oaks",
        "date": "Friday, May 6, 2022",
        "details": "The Kentucky Oaks is a rade 1 Stakes horse race held annually on the Friday before the Kentucky Derby in May."
      },
      {
        "id": 149,
        "holiday": "National Nurses Day",
        "date": "Friday, May 6, 2022",
        "details": "National Nurses Day is an occasion to honor the work of nurses."
      },
      {
        "id": 150,
        "holiday": "Military Spouse Appreciation Day",
        "date": "Friday, May 6, 2022",
        "details": "Appreciate and thank all the military spouses and partners you know on Military Spouse Appreciation Day."
      },
      {
        "id": 151,
        "holiday": "Kentucky Derby",
        "date": "Saturday, May 7, 2022",
        "details": "Kentucky Derby is a Grade I Stakes horse race held annually in Louisville, Kentucky in May."
      },
      {
        "id": 152,
        "holiday": "National Explosive Ordnance Disposal (EOD) Day",
        "date": "Saturday, May 7, 2022",
        "details": "National Explosive Ordnance Disposal (EOD) Day is an occasion to remember those serving the profession of explosive ordnance disposal in the United States Armed Forces."
      },
      {
        "id": 153,
        "holiday": "Time of Remembrance and Reconciliation for Those Who Lost Their Lives during the Second World War",
        "date": "Sunday, May 8, 2022",
        "details": "The United Nations’ (UN) Time of Remembrance and Reconciliation for Those Who Lost Their Lives during the Second World War is annually held over two days, from May 8-9."
      },
      {
        "id": 154,
        "holiday": "World Ovarian Cancer Day",
        "date": "Sunday, May 8, 2022",
        "details": "World Ovarian Cancer Day aims to spread global awareness about ovarian cancer."
      },
      {
        "id": 155,
        "holiday": "Mother's Day",
        "date": "Sunday, May 8, 2022",
        "details": "Mother's Day celebrates the role of mothers and mother figures."
      },
      {
        "id": 156,
        "holiday": "Truman Day",
        "date": "Sunday, May 8, 2022",
        "details": "Truman Day is a holiday in the state of Missouri to honor Harry S Truman, the only person born in Missouri to ever become President of the United States."
      },
      {
        "id": 157,
        "holiday": "Victory in Europe Day",
        "date": "Sunday, May 8, 2022",
        "details": "Victory in Europe Day is a observance in the USA"
      },
      {
        "id": 158,
        "holiday": "Truman Day observed",
        "date": "Monday, May 9, 2022",
        "details": "Truman Day is a holiday in the state of Missouri to honor Harry S Truman, the only person born in Missouri to ever become President of the United States."
      },
      {
        "id": 159,
        "holiday": "Confederate Memorial Day",
        "date": "Tuesday, May 10, 2022",
        "details": "On Confederate Memorial Day remembers the soldiers who died fighting for the Confederate States of America during the American Civil War (1861-1865). It is a state holiday in some parts of the United States."
      },
      {
        "id": 160,
        "holiday": "Primary Election Day",
        "date": "Tuesday, May 10, 2022",
        "details": "Many residents in West Virginia vote during the state’s primary election day."
      },
      {
        "id": 161,
        "holiday": "International Nurses Day",
        "date": "Thursday, May 12, 2022",
        "details": "International Nurses Day focuses on the critical contribution of nurses around the world in maintaining public health."
      },
      {
        "id": 162,
        "holiday": "Friday the 13th",
        "date": "Friday, May 13, 2022",
        "details": "Friday the 13th is a day full of superstitious beliefs in communities worldwide."
      },
      {
        "id": 163,
        "holiday": "Native American Day",
        "date": "Friday, May 13, 2022",
        "details": "Native Americans' Day, on the second Monday of October, is celebrated some parts of the United States in lieu of Columbus Day."
      },
      {
        "id": 164,
        "holiday": "World Migratory Bird Day",
        "date": "Saturday, May 14, 2022",
        "details": "World Migratory Bird Day is observed the second weekend of May every year."
      },
      {
        "id": 165,
        "holiday": "International Day of Families",
        "date": "Sunday, May 15, 2022",
        "details": "The International Day of Families is an occasion to celebrate the importance of families to people, societies and cultures around the world."
      },
      {
        "id": 166,
        "holiday": "Peace Officers Memorial Day",
        "date": "Sunday, May 15, 2022",
        "details": "Peace Officers Memorial Day is held annually in the United States on May 15 in honor of federal, state and local officers killed or disabled in the line of duty."
      },
      {
        "id": 167,
        "holiday": "Day of Vesak",
        "date": "Monday, May 16, 2022",
        "details": "Vesak Day is a Buddhist holiday that celebrates the birth of its founder. It is usually observed on the day of the full moon in May."
      },
      {
        "id": 168,
        "holiday": "World Information Society Day",
        "date": "Tuesday, May 17, 2022",
        "details": "World Information Society Day is celebrated each year to raise awareness of how information and communication can be beneficial for societies and economies."
      },
      {
        "id": 169,
        "holiday": "Lag BaOmer",
        "date": "Thursday, May 19, 2022",
        "details": "Many Jewish Americans observe Lag B’Omer on the 18th day of the month of Iyar in the Jewish calendar."
      },
      {
        "id": 170,
        "holiday": "World Autoimmune / Autoinflammatory Arthritis Day",
        "date": "Friday, May 20, 2022",
        "details": "World Autoimmune / Autoinflammatory Arthritis Day is a worldwide observance in the USA"
      },
      {
        "id": 171,
        "holiday": "National Defense Transportation Day",
        "date": "Friday, May 20, 2022",
        "details": "National Defense Transportation Day occurs annually in the United States on the third Friday of May."
      },
      {
        "id": 172,
        "holiday": "World Day for Cultural Diversity for Dialogue and Development",
        "date": "Saturday, May 21, 2022",
        "details": "The World Day for Cultural Diversity for Dialogue and Development, held on May 21, is an occasion for people to deepen their understanding of cultural diversity."
      },
      {
        "id": 173,
        "holiday": "Armed Forces Day",
        "date": "Saturday, May 21, 2022",
        "details": "Armed Forces Day is a national observance in the United States on the third Saturday of May each year."
      },
      {
        "id": 174,
        "holiday": "Preakness Stakes",
        "date": "Saturday, May 21, 2022",
        "details": "The Preakness Stakes is the second event in the Triple Crown and is annually held two weeks after the Kentucky Derby."
      },
      {
        "id": 175,
        "holiday": "International Day for Biological Diversity",
        "date": "Sunday, May 22, 2022",
        "details": "The International Day for Biological Diversity is an occasion to increase the global understanding and awareness of issues and challenges around biodiversity."
      },
      {
        "id": 176,
        "holiday": "National Maritime Day",
        "date": "Sunday, May 22, 2022",
        "details": "National Maritime Day is annually observed in the United States on May 22. It is a time to observe its maritime heritage, to honor those who served as merchant mariners, and to recognize the benefits of the maritime industry."
      },
      {
        "id": 177,
        "holiday": "Harvey Milk Day",
        "date": "Sunday, May 22, 2022",
        "details": "Harvey Milk Day is an observance that is recognized in public schools in California, United States, on May 22 each year."
      },
      {
        "id": 178,
        "holiday": "International Day to End Obstetric Fistula",
        "date": "Monday, May 23, 2022",
        "details": "The International Day to End Obstetric Fistula raises awareness of fistula and calls for support to tackle the problem."
      },
      {
        "id": 179,
        "holiday": "African Liberation Day",
        "date": "Wednesday, May 25, 2022",
        "details": "African Liberation Day celebrates African nations' hard-fought freedom from European colonial powers."
      },
      {
        "id": 180,
        "holiday": "Emergency Medical Services for Children Day",
        "date": "Wednesday, May 25, 2022",
        "details": "Emergency Medical Services for Children (EMSC) Day is observed on the Wednesday of Emergency Medical Services (EMS) Week, May 19–25, in the United States."
      },
      {
        "id": 181,
        "holiday": "National Missing Children's Day",
        "date": "Wednesday, May 25, 2022",
        "details": "National Missing Children's Day is an observation dedicated to addressing the problem of child abduction."
      },
      {
        "id": 182,
        "holiday": "Ascension Day",
        "date": "Thursday, May 26, 2022",
        "details": "Ascension Day is the 40th day of Easter and commemorates the ascension of Jesus Christ into heaven."
      },
      {
        "id": 183,
        "holiday": "International Day of United Nations Peacekeepers",
        "date": "Sunday, May 29, 2022",
        "details": "The International Day of United Nations Peacekeepers is an occasion to pay tribute to people who served in United Nations (UN) peacekeeping operations."
      },
      {
        "id": 184,
        "holiday": "Memorial Day",
        "date": "Monday, May 30, 2022",
        "details": "Memorial Day commemorates all Americans who have died in military service for the United States."
      },
      {
        "id": 185,
        "holiday": "Jefferson Davis' Birthday",
        "date": "Monday, May 30, 2022",
        "details": "Jefferson Davis' Birthday, also known as Jefferson Davis Day, is a state holiday in Alabama in the United States."
      },
      {
        "id": 186,
        "holiday": "World No Tobacco Day",
        "date": "Tuesday, May 31, 2022",
        "details": "World No Tobacco Day draws attention to the health problems caused by tobacco use."
      },
      {
        "id": 187,
        "holiday": "Global Day of Parents",
        "date": "Wednesday, June 1, 2022",
        "details": "Global Day of Parents appreciates the role of a parent in nurturing and fostering growth for their children."
      },
      {
        "id": 188,
        "holiday": "First Day of Pride Month",
        "date": "Wednesday, June 1, 2022",
        "details": "First Day of Pride Month is a annual monthly observance in the USA"
      },
      {
        "id": 189,
        "holiday": "Statehood Day",
        "date": "Wednesday, June 1, 2022",
        "details": "Statehood Day marks the anniversary of the dates that Kentucky became the 15th state and Tennessee became the 16th state of the United States."
      },
      {
        "id": 190,
        "holiday": "Native American Day",
        "date": "Thursday, June 2, 2022",
        "details": "Native Americans' Day, on the second Monday of October, is celebrated some parts of the United States in lieu of Columbus Day."
      },
      {
        "id": 191,
        "holiday": "Jefferson Davis' Birthday",
        "date": "Friday, June 3, 2022",
        "details": "Jefferson Davis' Birthday, also known as Jefferson Davis Day, is a state holiday in Alabama in the United States."
      },
      {
        "id": 192,
        "holiday": "International Day of Innocent Children Victims of Aggression",
        "date": "Saturday, June 4, 2022",
        "details": "The United Nations' (UN) International Day of Innocent Children Victims of Aggression is observed on June 4 each year."
      },
      {
        "id": 193,
        "holiday": "Pentecost",
        "date": "Sunday, June 5, 2022",
        "details": "Many Christians in the United States observe Pentecost, also known as Whitsunday or Whit Sunday."
      },
      {
        "id": 194,
        "holiday": "Shavuot",
        "date": "Sunday, June 5, 2022",
        "details": "Shavuot, also known as the Festival of Weeks, is one of three major Jewish festivals."
      },
      {
        "id": 195,
        "holiday": "World Environment Day",
        "date": "Sunday, June 5, 2022",
        "details": "World Environment Day is held each year on June 5. It is one of the principal vehicles through which the United Nations (UN) stimulates worldwide awareness of the environment and enhances political attention and action."
      },
      {
        "id": 196,
        "holiday": "Whit Monday",
        "date": "Monday, June 6, 2022",
        "details": "Many Christians in the United States will observe Whit Monday, or Pentecost Monday. It is the day after Pentecost, which is also known as Whit Sunday or Whitsunday."
      },
      {
        "id": 197,
        "holiday": "Jefferson Davis' Birthday",
        "date": "Monday, June 6, 2022",
        "details": "Jefferson Davis' Birthday, also known as Jefferson Davis Day, is a state holiday in Alabama in the United States."
      },
      {
        "id": 198,
        "holiday": "D-Day",
        "date": "Monday, June 6, 2022",
        "details": "D-Day is a special anniversary in some countries, including the United States (U.S.), to remember Allied forces’ invasion of Normandy, France, in the Second World War."
      },
      {
        "id": 199,
        "holiday": "World Oceans Day",
        "date": "Wednesday, June 8, 2022",
        "details": "World Oceans Day is annually observed on June 8 to raise awareness of the challenges humanity faces to protect the world's oceans."
      },
      {
        "id": 200,
        "holiday": "Kamehameha Day observed",
        "date": "Friday, June 10, 2022",
        "details": "Kamehameha Day, held annually on June 11, honors Kamehameha the Great (Kamehameha I), the monarch who united and established the Kingdom of Hawaii."
      },
      {
        "id": 201,
        "holiday": "Kamehameha Day",
        "date": "Saturday, June 11, 2022",
        "details": "Kamehameha Day, held annually on June 11, honors Kamehameha the Great (Kamehameha I), the monarch who united and established the Kingdom of Hawaii."
      },
      {
        "id": 202,
        "holiday": "Belmont Stakes",
        "date": "Saturday, June 11, 2022",
        "details": "The Belmont Stakes is the third and final horse race of the Triple Crown. It is run annually five weeks after the Kentucky Derby."
      },
      {
        "id": 203,
        "holiday": "Trinity Sunday",
        "date": "Sunday, June 12, 2022",
        "details": "Trinity Sunday is the first Sunday after Pentecost and is celebrated by many Christians in the United States."
      },
      {
        "id": 204,
        "holiday": "World Day Against Child Labour",
        "date": "Sunday, June 12, 2022",
        "details": "Poverty and injustice against widows is a world-wide problem addressed by International Widows' Day."
      },
      {
        "id": 205,
        "holiday": "Bunker Hill Day",
        "date": "Sunday, June 12, 2022",
        "details": "Bunker Hill Day commemorates the Battle of Bunker Hill, which took place on June 17, 1775 on the Charlestown Peninsula, Boston Harbor, in Massachusetts."
      },
      {
        "id": 206,
        "holiday": "Loving Day",
        "date": "Sunday, June 12, 2022",
        "details": "Loving Day is a observance in the USA"
      },
      {
        "id": 207,
        "holiday": "International Albinism Awareness Day",
        "date": "Monday, June 13, 2022",
        "details": "International Albinism Awareness Day aims to stop the persecution and murders of people with albinism."
      },
      {
        "id": 208,
        "holiday": "World Blood Donor Day",
        "date": "Tuesday, June 14, 2022",
        "details": "On World Blood Donor Day numerous events are held worldwide to raise awareness about the importance of safe blood supplies."
      },
      {
        "id": 209,
        "holiday": "Army Birthday",
        "date": "Tuesday, June 14, 2022",
        "details": "Army Birthday is a observance in the USA"
      },
      {
        "id": 210,
        "holiday": "Flag Day",
        "date": "Tuesday, June 14, 2022",
        "details": "Flag Day is annually held on June 14 to honor the United States flag."
      },
      {
        "id": 211,
        "holiday": "World Elder Abuse Awareness Day",
        "date": "Wednesday, June 15, 2022",
        "details": "World Elder Abuse Awareness Day attempts to shine a light on the problem of physical, emotional, and financial abuse of elders."
      },
      {
        "id": 212,
        "holiday": "Corpus Christi",
        "date": "Thursday, June 16, 2022",
        "details": "Corpus Christi is observed in honor of the Holy Eucharist."
      },
      {
        "id": 213,
        "holiday": "International Day of Family Remittances",
        "date": "Thursday, June 16, 2022",
        "details": "The UN estimates that family remittances worth over 500 billion US$ are transferred worldwide every year."
      },
      {
        "id": 214,
        "holiday": "World Day to Combat Desertification and Drought",
        "date": "Friday, June 17, 2022",
        "details": "The United Nations' World Day to Combat Desertification and Drought is observed worldwide on June 17 each year."
      },
      {
        "id": 215,
        "holiday": "Juneteenth National Freedom Day",
        "date": "Saturday, June 18, 2022",
        "details": "Juneteenth, Freedom Day, or Emancipation Day, celebrates the anniversary of the abolition of slavery in Texas on June 19, 1865."
      },
      {
        "id": 216,
        "holiday": "International Day for the Elimination of Sexual Violence in Conflict",
        "date": "Sunday, June 19, 2022",
        "details": "International Day for the Elimination of Sexual Violence in Conflict is a UN day aiming to rid the world of conflict-related sexual violence."
      },
      {
        "id": 217,
        "holiday": "Father's Day",
        "date": "Sunday, June 19, 2022",
        "details": "Father's Day celebrates the contribution that fathers and father figures make to the lives of their children."
      },
      {
        "id": 218,
        "holiday": "Juneteenth Day",
        "date": "Sunday, June 19, 2022",
        "details": "Juneteenth, Freedom Day, or Emancipation Day, celebrates the anniversary of the abolition of slavery in Texas on June 19, 1865."
      },
      {
        "id": 219,
        "holiday": "World Refugee Day",
        "date": "Monday, June 20, 2022",
        "details": "The United Nations' World Refugee Day honors refugees' courage, strength and determination."
      },
      {
        "id": 220,
        "holiday": "Day off for Juneteenth National Freedom Day",
        "date": "Monday, June 20, 2022",
        "details": "Juneteenth, Freedom Day, or Emancipation Day, celebrates the anniversary of the abolition of slavery in Texas on June 19, 1865."
      },
      {
        "id": 221,
        "holiday": "West Virginia Day",
        "date": "Monday, June 20, 2022",
        "details": "West Virginia Day, or WV Day, celebrates the anniversary of the creation of the state of West Virginia on June 20, 1863."
      },
      {
        "id": 222,
        "holiday": "American Eagle Day",
        "date": "Monday, June 20, 2022",
        "details": "Observed annually on June 20 in 47 American states, American Eagle Day is an unofficial holiday that celebrates the removal of the American Bald Eagle from a list of 'endangered species'."
      },
      {
        "id": 223,
        "holiday": "International Day of Yoga",
        "date": "Tuesday, June 21, 2022",
        "details": "The International Day of Yoga is a UN-day that aims to raise awareness worldwide of the many benefits of practicing yoga."
      },
      {
        "id": 224,
        "holiday": "June Solstice",
        "date": "Tuesday, June 21, 2022",
        "details": "June Solstice in the USA (New York)"
      },
      {
        "id": 225,
        "holiday": "Public Service Day",
        "date": "Thursday, June 23, 2022",
        "details": "The United Nations’ Public Service Day celebrates the idea that democracy and successful governance depend on a competent civil service."
      },
      {
        "id": 226,
        "holiday": "International Widows' Day",
        "date": "Thursday, June 23, 2022",
        "details": "Poverty and injustice against widows is a world-wide problem addressed by International Widows' Day."
      },
      {
        "id": 227,
        "holiday": "Day of the Seafarer",
        "date": "Saturday, June 25, 2022",
        "details": "The Day of the Seafarer aims to acknowledge the social, and economic contribution of the millions of seafarers around the world."
      },
      {
        "id": 228,
        "holiday": "International Day Against Drug Abuse and Illicit Trafficking",
        "date": "Sunday, June 26, 2022",
        "details": "The United Nations’ (UN) International Day Against Drug Abuse and Illicit Trafficking raise awareness about the dangers of illicit drugs."
      },
      {
        "id": 229,
        "holiday": "International Day in Support of Victims of Torture",
        "date": "Sunday, June 26, 2022",
        "details": "The United Nations’ (UN) International Day in Support of Victims of Torture is annually observed on June 26 to remind people that human torture is not only unacceptable – it is also a crime."
      },
      {
        "id": 230,
        "holiday": "International Asteroid Day",
        "date": "Thursday, June 30, 2022",
        "details": "The United Nations established International Asteroid Day to raise public awareness of the asteroid impact hazard."
      },
      {
        "id": 231,
        "holiday": "International Day of Cooperatives",
        "date": "Saturday, July 2, 2022",
        "details": "The United Nations' (UN) International Day of Cooperatives recognizes and reaffirms the role of cooperatives in economic, social and cultural development and in the achievement of social policy objectives."
      },
      {
        "id": 232,
        "holiday": "Independence Day",
        "date": "Monday, July 4, 2022",
        "details": "On Independence Day, Americans celebrate the anniversary of publication of the Declaration of Independence from Great Britain in 1776."
      },
      {
        "id": 233,
        "holiday": "Eid al-Adha",
        "date": "Sunday, July 10, 2022",
        "details": "Eid-al-Adha is an Islamic festival to mark Ibrahim's willingness to follow Allah's command to sacrifice his son. It is celebrated around the 10th to 13th days of the Islamic month of Dhu al-Hijjah."
      },
      {
        "id": 234,
        "holiday": "World Population Day",
        "date": "Monday, July 11, 2022",
        "details": "The United Nations' (UN) World Population Day reaffirms the human right to plan for a family."
      },
      {
        "id": 235,
        "holiday": "Nathan Bedford Forrest Day",
        "date": "Wednesday, July 13, 2022",
        "details": "Nathan Bedford Forrest Day is a local observance in the USA"
      },
      {
        "id": 236,
        "holiday": "Bastille Day",
        "date": "Thursday, July 14, 2022",
        "details": "Bastille Day is a observance in the USA"
      },
      {
        "id": 237,
        "holiday": "World Youth Skills Day",
        "date": "Friday, July 15, 2022",
        "details": "Acquiring skills enhances youths' ability to make informed choices and empowers them to gain access to changing labor markets."
      },
      {
        "id": 238,
        "holiday": "Rural Transit Day",
        "date": "Saturday, July 16, 2022",
        "details": "Rural Transit Day is a observance in the USA"
      },
      {
        "id": 239,
        "holiday": "Nelson Mandela Day",
        "date": "Monday, July 18, 2022",
        "details": "Nelson Mandela International Day is annually observed on July 18 to recognize the former South African president’s contribution to peace and freedom."
      },
      {
        "id": 240,
        "holiday": "Pioneer Day",
        "date": "Sunday, July 24, 2022",
        "details": "Pioneer Day is an annual state holiday in Utah in the United States. It is celebrated to honor the pioneers who demonstrated industry and bravery when they ventured to settle in a place that is now Salt Lake City."
      },
      {
        "id": 241,
        "holiday": "Parents' Day",
        "date": "Sunday, July 24, 2022",
        "details": "Parents’ Day is celebrated in the United States on the fourth Sunday of July each year to recognize and promote parenting as a crucial part of families and the wider community."
      },
      {
        "id": 242,
        "holiday": "Pioneer Day observed",
        "date": "Monday, July 25, 2022",
        "details": "Pioneer Day is an annual state holiday in Utah in the United States. It is celebrated to honor the pioneers who demonstrated industry and bravery when they ventured to settle in a place that is now Salt Lake City."
      },
      {
        "id": 243,
        "holiday": "National Korean War Veterans Armistice Day",
        "date": "Wednesday, July 27, 2022",
        "details": "National Korean War Veterans Armistice Day is a observance in the USA"
      },
      {
        "id": 244,
        "holiday": "World Hepatitis Day",
        "date": "Thursday, July 28, 2022",
        "details": "World Hepatitis Day is observed on July 28 every year to raise awareness of hepatitis and encourage prevention and treatment."
      },
      {
        "id": 245,
        "holiday": "Muharram",
        "date": "Saturday, July 30, 2022",
        "details": "The first day of Muharram, which is the first month in the Islamic calendar, marks the start of the Islamic New Year."
      },
      {
        "id": 246,
        "holiday": "International Day of Friendship",
        "date": "Saturday, July 30, 2022",
        "details": "The International Day of Friendship is annually held on July 30 to celebrate friendships worldwide."
      },
      {
        "id": 247,
        "holiday": "World Day against Trafficking in Persons",
        "date": "Monday, August 1, 2022",
        "details": "July 30 is the UN World Day against Trafficking in Persons"
      },
      {
        "id": 248,
        "holiday": "Colorado Day",
        "date": "Monday, August 1, 2022",
        "details": "Colorado Day is an annual observance that commemorates the state’s birthday on August 1, 1876, and its history."
      },
      {
        "id": 249,
        "holiday": "Coast Guard Birthday",
        "date": "Thursday, August 4, 2022",
        "details": "Coast Guard Birthday is a observance in the USA"
      },
      {
        "id": 250,
        "holiday": "Barack Obama Day",
        "date": "Thursday, August 4, 2022",
        "details": "Barack Obama Day is a observance in the USA"
      },
      {
        "id": 251,
        "holiday": "Tisha B'Av",
        "date": "Sunday, August 7, 2022",
        "details": "Tisha B’Av is on the ninth day of the month of Av in the Jewish calendar."
      },
      {
        "id": 252,
        "holiday": "Purple Heart Day",
        "date": "Sunday, August 7, 2022",
        "details": "Purple Heart Day on August 7 commemorates the day in 1782 when General George Washington created the Purple Heart Medal – a military decoration that is awarded to those wounded or killed while serving in the United States Armed Forces."
      },
      {
        "id": 253,
        "holiday": "Victory Day",
        "date": "Monday, August 8, 2022",
        "details": "Victory Day, also known as VJ Day, is an annual state holiday celebrated on the second Monday in August in Rhode Island in the United States. It marks the anniversary of the Allies’ victory over Japan during World War II."
      },
      {
        "id": 254,
        "holiday": "International Day of the World's Indigenous People",
        "date": "Tuesday, August 9, 2022",
        "details": "The United Nations’ (UN) International Day of the World's Indigenous People is observed on August 9 each year to promote and protect the rights of the world’s indigenous peoples."
      },
      {
        "id": 255,
        "holiday": "International Youth Day",
        "date": "Friday, August 12, 2022",
        "details": "The United Nations’ (UN) International Youth Day is annually held on August 12 to celebrate the achievements of the world’s youth and to encourage their participation in enhancing society."
      },
      {
        "id": 256,
        "holiday": "Assumption of Mary",
        "date": "Monday, August 15, 2022",
        "details": "Assumption Day is a Christian observance in the United States that is held annually on August 15. Catholics observe the Dormition (falling asleep) or the day that the Blessed Virgin Mary was received into heaven."
      },
      {
        "id": 257,
        "holiday": "Bennington Battle Day",
        "date": "Tuesday, August 16, 2022",
        "details": "Bennington Battle Day is a state holiday in Vermont. It commemorates the American victory at the Battle of Bennington during the Revolutionary War in north America in 1777."
      },
      {
        "id": 258,
        "holiday": "World Humanitarian Day",
        "date": "Friday, August 19, 2022",
        "details": "The United Nations’(UN) World Humanitarian Day focuses on increasing public awareness about humanitarian service worldwide and is annually observed on August 19."
      },
      {
        "id": 259,
        "holiday": "Hawaii Statehood Day",
        "date": "Friday, August 19, 2022",
        "details": "Hawaii’s Statehood Day is celebrated on the third Friday of August to commemorate the anniversary of Hawaii’s statehood."
      },
      {
        "id": 260,
        "holiday": "National Aviation Day",
        "date": "Friday, August 19, 2022",
        "details": "National Aviation Day is observed in the United States on August 19 each year to celebrate the history and development of the aviation."
      },
      {
        "id": 261,
        "holiday": "Senior Citizens Day",
        "date": "Sunday, August 21, 2022",
        "details": "National Senior Citizens Day is an observance on August 21 to honor the contributions of senior citizens in the United States."
      },
      {
        "id": 262,
        "holiday": "International Day for the Remembrance of the Slave Trade and its Abolition",
        "date": "Tuesday, August 23, 2022",
        "details": "The United Nations’ (UN) International Day for the Remembrance of the Slave Trade and its Abolition is held on August 23 each year to remind people of the tragedy of the transatlantic slave trade."
      },
      {
        "id": 263,
        "holiday": "Women's Equality Day",
        "date": "Friday, August 26, 2022",
        "details": "Women's Equality Day on August 26 is an annual observance that commemorates the anniversary of the first time voting rights were extended to women in the United States."
      },
      {
        "id": 264,
        "holiday": "Lyndon Baines Johnson Day",
        "date": "Saturday, August 27, 2022",
        "details": "Lyndon Baines Johnson Day is a state holiday in Texas in the United States on August 27 each year. It commemorates the birthday of Lyndon Baines Johnson, who was the 36th president of the USA."
      },
      {
        "id": 265,
        "holiday": "International Day against Nuclear Tests",
        "date": "Monday, August 29, 2022",
        "details": "The United Nations’ (UN) International Day against Nuclear Tests is annually observed on August 29. The day raises awareness of the dangers of nuclear weapons and a closer approach to eliminating the use of those weapons."
      },
      {
        "id": 266,
        "holiday": "International Day of the Victims of Enforced Disappearances",
        "date": "Tuesday, August 30, 2022",
        "details": "The International Day of the Victims of Enforced Disappearances is annually observed on August 30."
      },
      {
        "id": 267,
        "holiday": "International Overdose Awareness Day",
        "date": "Wednesday, August 31, 2022",
        "details": "International Overdose Awareness Day is an annual observation which aims to raise global awareness of about the impact of drug overdose on families and communities. The campaign also attempts to remove the stigma associated with overdose."
      },
      {
        "id": 268,
        "holiday": "World Sexual Health Day",
        "date": "Sunday, September 4, 2022",
        "details": "World Sexual Health Day is an annual awareness day that attempts to break down social and cultural taboos associated with sexuality and to promote sexual health around the world."
      },
      {
        "id": 269,
        "holiday": "International Day of Charity",
        "date": "Monday, September 5, 2022",
        "details": "The International Day of Charity raises public awareness of what charities do to help minimize poverty."
      },
      {
        "id": 270,
        "holiday": "Labor Day",
        "date": "Monday, September 5, 2022",
        "details": "Labor Day is a federal holiday in the United States. It gives workers a day of rest and it celebrates their contribution to the American economy."
      },
      {
        "id": 271,
        "holiday": "International Literacy Day",
        "date": "Thursday, September 8, 2022",
        "details": "The United Nations' (UN) International Literacy Day is held on September 8 each year."
      },
      {
        "id": 272,
        "holiday": "California Admission Day",
        "date": "Friday, September 9, 2022",
        "details": "California Admission Day is an annual legal observance in California, in the United States."
      },
      {
        "id": 273,
        "holiday": "World Suicide Prevention Day",
        "date": "Saturday, September 10, 2022",
        "details": "World Suicide Prevention Day promotes worldwide action to prevent suicides on September 10 each year."
      },
      {
        "id": 274,
        "holiday": "Carl Garner Federal Lands Cleanup Day",
        "date": "Saturday, September 10, 2022",
        "details": "Carl Garner Federal Lands Cleanup Day encourages people in the United States to participate in cleaning up the federal lands. It is observed on the first Saturday after Labor Day."
      },
      {
        "id": 275,
        "holiday": "First Responders Day",
        "date": "Sunday, September 11, 2022",
        "details": "First Responders Day is a state observation in the USA"
      },
      {
        "id": 276,
        "holiday": "Patriot Day",
        "date": "Sunday, September 11, 2022",
        "details": "Patriot Day is held in memory of nearly 3000 people who died during terrorist attacks in New York, Washington DC and Shanksville, Pennsylvania, in the United States."
      },
      {
        "id": 277,
        "holiday": "National Grandparents Day",
        "date": "Sunday, September 11, 2022",
        "details": "National Grandparents Day is celebrated on the first Sunday of September after Labor Day in the United States."
      },
      {
        "id": 278,
        "holiday": "International Day for South-South Cooperation",
        "date": "Monday, September 12, 2022",
        "details": "The United Nations Day for South-South Cooperation is observed on September 12 each year."
      },
      {
        "id": 279,
        "holiday": "International Programmers' Day",
        "date": "Tuesday, September 13, 2022",
        "details": "Many people celebrate International Programmers’ Day on January 7, while others observe this event on the 256th day of the year, usually on September 13 or on September 12 in leap years."
      },
      {
        "id": 280,
        "holiday": "International Day of Democracy",
        "date": "Thursday, September 15, 2022",
        "details": "The United Nations’ (UN) International Day of Democracy is observed on September 15 each year."
      },
      {
        "id": 281,
        "holiday": "International Day for the Preservation of the Ozone Layer",
        "date": "Friday, September 16, 2022",
        "details": "The United Nations' (UN) International Day for the Preservation of the Ozone Layer focuses on the importance of protecting human health and the environment."
      },
      {
        "id": 282,
        "holiday": "Constitution Day and Citizenship Day observed",
        "date": "Friday, September 16, 2022",
        "details": "Constitution Day and Citizenship Day is a combined event that occurs in the United States on September 17 each year."
      },
      {
        "id": 283,
        "holiday": "National POW/MIA Recognition Day",
        "date": "Friday, September 16, 2022",
        "details": "National POW/MIA Recognition Day is annually observed in the United States on the third Friday of September."
      },
      {
        "id": 284,
        "holiday": "Still's Disease Awareness Day",
        "date": "Saturday, September 17, 2022",
        "details": "Still's Disease Awareness Day is a worldwide observance in the USA"
      },
      {
        "id": 285,
        "holiday": "Constitution Day and Citizenship Day",
        "date": "Saturday, September 17, 2022",
        "details": "Constitution Day and Citizenship Day is a combined event that occurs in the United States on September 17 each year."
      },
      {
        "id": 286,
        "holiday": "National CleanUp Day",
        "date": "Saturday, September 17, 2022",
        "details": "National CleanUp Day is a observance in the USA"
      },
      {
        "id": 287,
        "holiday": "Air Force Birthday",
        "date": "Sunday, September 18, 2022",
        "details": "Air Force Birthday is a observance in the USA"
      },
      {
        "id": 288,
        "holiday": "International Day of Peace",
        "date": "Wednesday, September 21, 2022",
        "details": "The United Nations' (UN) International Day of Peace is annually held on September 21 to recognize the efforts of individuals, organizations and governments to end conflict and promote peace."
      },
      {
        "id": 289,
        "holiday": "World Maritime Day",
        "date": "Thursday, September 22, 2022",
        "details": "World Maritime Day is held on the last week of September each year, although the exact date is up to individual governments around the world."
      },
      {
        "id": 290,
        "holiday": "Emancipation Day",
        "date": "Thursday, September 22, 2022",
        "details": "Emancipation Day is a state-wide observation in Ohio on September 22."
      },
      {
        "id": 291,
        "holiday": "International Celebrate Bisexuality Day",
        "date": "Friday, September 23, 2022",
        "details": "International Celebrate Bisexuality Day, also known as Bi Visibility Day, promotes the rights of bisexual people around the world."
      },
      {
        "id": 292,
        "holiday": "September Equinox",
        "date": "Friday, September 23, 2022",
        "details": "September Equinox in the USA (New York)"
      },
      {
        "id": 293,
        "holiday": "Gold Star Mother's Day",
        "date": "Sunday, September 25, 2022",
        "details": "Gold Star Mother’s Day is annually observed in the United States on the last Sunday of September."
      },
      {
        "id": 294,
        "holiday": "International Day for the Total Elimination of Nuclear Weapons",
        "date": "Monday, September 26, 2022",
        "details": "The International Day for the Total Elimination of Nuclear Weapons raises awareness about the dangers of nuclear weapons."
      },
      {
        "id": 295,
        "holiday": "American Indian Day",
        "date": "Monday, September 26, 2022",
        "details": "American Indian Day is a state observation in the USA"
      },
      {
        "id": 296,
        "holiday": "Rosh Hashana",
        "date": "Monday, September 26, 2022",
        "details": "Rosh Hashana, also spelled Rosh Hashanah, is commonly known as the Jewish New Year. The event begins on the first day of Tishrei (or Tishri), which is the seventh month in the Jewish calendar."
      },
      {
        "id": 297,
        "holiday": "World Tourism Day",
        "date": "Tuesday, September 27, 2022",
        "details": "The United Nations’ (UN) World Tourism Day is annually held on September 27 to raise awareness on the benefits of tourism."
      },
      {
        "id": 298,
        "holiday": "World Rabies Day",
        "date": "Wednesday, September 28, 2022",
        "details": "World Rabies Day is annually observed on September 28 to raise awareness about rabies and how it can be prevented."
      },
      {
        "id": 299,
        "holiday": "World Heart Day",
        "date": "Thursday, September 29, 2022",
        "details": "World Heart Day raises awareness of cardiovascular diseases and ways to reduce their risk."
      },
      {
        "id": 300,
        "holiday": "Native American Day",
        "date": "Friday, September 30, 2022",
        "details": "Native Americans' Day, on the second Monday of October, is celebrated some parts of the United States in lieu of Columbus Day."
      },
      {
        "id": 301,
        "holiday": "American Indian Heritage Day",
        "date": "Friday, September 30, 2022",
        "details": "American Indian Heritage Day is often observed on the Friday after Thanksgiving Day in the United States."
      },
      {
        "id": 302,
        "holiday": "Michigan Indian Day",
        "date": "Friday, September 30, 2022",
        "details": "Michigan Indian Day is a state observation in the USA"
      },
      {
        "id": 303,
        "holiday": "International Day of Older Persons",
        "date": "Saturday, October 1, 2022",
        "details": "The United Nations' (UN) International Day of Older Persons is celebrated on October 1 each year as a special day for older persons worldwide."
      },
      {
        "id": 304,
        "holiday": "World Vegetarian Day",
        "date": "Saturday, October 1, 2022",
        "details": "World Vegetarian Day is an annual observation that spreads awareness about the health, environmental, and ethical benefits of following a vegetarian lifestyle. The unofficial holiday encourages people to avoid eating foods that include animal products and to adopt a plant-based diet."
      },
      {
        "id": 305,
        "holiday": "International Day of Non-Violence",
        "date": "Sunday, October 2, 2022",
        "details": "The United Nations’ (UN) International Day of Non-Violence is a globally observed on October 2 each year to promote non-violence."
      },
      {
        "id": 306,
        "holiday": "World Habitat Day",
        "date": "Monday, October 3, 2022",
        "details": "The United Nations’ (UN) World Habitat Day reflects on the state of human settlements and people’s right to sufficient shelter."
      },
      {
        "id": 307,
        "holiday": "Frances Xavier Cabrini Day",
        "date": "Monday, October 3, 2022",
        "details": "Frances Xavier Cabrini Day is a state holiday in the USA"
      },
      {
        "id": 308,
        "holiday": "Child Health Day",
        "date": "Monday, October 3, 2022",
        "details": "Child Health Day is annually celebrated in the United States on the first Monday of October."
      },
      {
        "id": 309,
        "holiday": "Feast of St Francis of Assisi",
        "date": "Tuesday, October 4, 2022",
        "details": "Many Catholics in the United States, particularly those with pets, celebrate the Feast of St Francis of Assisi, the patron saint of animals and the environment, on October 4 each year."
      },
      {
        "id": 310,
        "holiday": "World Teachers' Day",
        "date": "Wednesday, October 5, 2022",
        "details": "The United Nations' (UN) World Teachers' Day commemorates the work of teachers and their contributions to society. It is observed on October 5 each year."
      },
      {
        "id": 311,
        "holiday": "Yom Kippur",
        "date": "Wednesday, October 5, 2022",
        "details": "Yom Kippur is an important Jewish holiday that falls on the 10th day of the month of Tishrei in the Jewish calendar."
      },
      {
        "id": 312,
        "holiday": "World Cerebral Palsy Day",
        "date": "Thursday, October 6, 2022",
        "details": "World Cerebral Palsy Day is an annual awareness observation that brings together people with cerebral palsy, their families and loved ones, and organizations working to ensure equal rights for them."
      },
      {
        "id": 313,
        "holiday": "The Prophet's Birthday",
        "date": "Saturday, October 8, 2022",
        "details": "Eid Milad ul-Nabi (Mawlid or Milad-un-Nabi) commemorates the Prophet Muhammed's birthday."
      },
      {
        "id": 314,
        "holiday": "World Post Day",
        "date": "Sunday, October 9, 2022",
        "details": "World Post Day marks the anniversary of the Universal Postal Union's establishment in 1874. It is held on October 9 each year."
      },
      {
        "id": 315,
        "holiday": "Leif Erikson Day",
        "date": "Sunday, October 9, 2022",
        "details": "Leif Erikson Day honors the first Scandinavian known to have set foot on American soil and the contribution of the Nordic peoples to the United States."
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 317,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 318,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 319,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 320,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 321,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 322,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 323,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 324,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 325,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 326,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 327,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 328,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 329,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 330,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 331,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 332,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 333,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 334,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 335,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 336,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 337,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 338,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 339,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 340,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 341,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 342,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 343,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 344,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 345,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 346,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 347,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 348,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 349,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 350,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 351,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 352,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 353,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 354,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 355,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 356,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 357,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 358,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 359,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 360,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 361,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 362,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 363,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 364,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 365,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 366,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 367,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 368,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },

      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },{
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },

      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },{
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },

      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },{
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      },
      {
        "id": 316,
        "holiday": "",
        "date": "",
        "details": ""
      }
      
    ]
  }
  

  