{
    "holidays": [
      {
        "id": 1,
        "name": "New Year's Day",
        "date": "Saturday, January 1, 2022",
        "details": "New Year's Day is the first day of the Gregorian calendar, which is widely used in many countries such as the USA."
      },
      {
        "id": 2,
        "name": "Chinese New Year",
        "date": "Tuesday, February 1, 2022",
        "details": "Chinese New Year marks the first day of the New Year in the Chinese calendar."
      },
      {
        "id": 3,
        "name": "Groundhog Day",
        "date": "Wednesday, February 2, 2022",
        "details": "Many people in the United States observe Groundhog Day on February 2."
      },
      {
        "id": 4,
        "name": "Easter",
        "date": "Sunday, April 24, 2022",
        "details": "Many Orthodox Christians in the United States mark Easter Sunday, also known as Pascha, as the day Jesus Christ was resurrected, according to the Christian bible."
      },
      {
        "id": 5,
        "name": "World Tuna Day",
        "date": "Monday, May 2, 2022",
        "details": "World Tuna Day is a UN holiday designed to raise awareness of the global importance of tuna."
      },
      {
        "id": 6,
        "name": "Memorial Day",
        "date": "Monday, May 30, 2022",
        "details": "Memorial Day commemorates all Americans who have died in military service for the United States."
      },
      {
        "id": 7,
        "name": "Independence Day",
        "date": "Monday, July 4, 2022",
        "details": "On Independence Day, Americans celebrate the anniversary of publication of the Declaration of Independence from Great Britain in 1776."
      },
      {
        "id": 8,
        "name": "Labor Day",
        "date": "Monday, September 5, 2022",
        "details": "Labor Day is a federal holiday in the United States. It gives workers a day of rest and it celebrates their contribution to the American economy."
      },
      {
        "id": 9,
        "name": "International Programmers' Day",
        "date": "Tuesday, September 13, 2022",
        "details": "Many people celebrate International Programmers’ Day on January 7, while others observe this event on the 256th day of the year, usually on September 13 or on September 12 in leap years."
      },
      {
        "id": 10,
        "name": "Thanksgiving Day",
        "date": "Thursday, November 24, 2022",
        "details": "Thanksgiving Day in the United States is traditionally a holiday to give thanks for the food collected at the end of the harvest season."
      },
      {
        "id": 10,
        "name": "Chanukah/Hanukkah (first day)",
        "date": "Monday, December 19, 2022",
        "details": "The first day of Hanukkah is the start of the Hanukkah period, which lasts for eight days, from the 25th day of the month of Kislev to the second day of Tevet in the Hebrew calendar."
      },
      {
        "id": 11,
        "name": "Christmas Eve",
        "date": "Saturday, December 24, 2022",
        "details": "Christmas Eve in the United States is on December 24 each year."
      },
      {
        "id": 12,
        "name": "Christmas Day",
        "date": "Sunday, December 25, 2022",
        "details": "Christmas Day celebrates Jesus Christ's birth."
      } 
    ]
  }
  

  